Revit 2024 API
BuiltInFailures.AutoRouteFailures.AttemptToConnectNonSlopingElementToSlopedPipeError Property
 You have specified that sloped pipe be drawn, but are trying to connect to an element that doesn't support sloping connections.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AttemptToConnectNonSlopingElementToSlopedPipeError { get; }
Visual Basic
Public Shared ReadOnly Property AttemptToConnectNonSlopingElementToSlopedPipeError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AttemptToConnectNonSlopingElementToSlopedPipeError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace